<!DOCTYPE html><html lang="ro"><head><meta charset="UTF-8"><meta name="author" content="arxde"><meta name="description" content="Articole &#351;tiin&#355;ifice."><meta name="keywords" content="arxde, publicatii, publica&#355;ii, articole"><meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=yes"><title>Articole &#351;tiin&#355;ifice.</title><link rel="preload" as="style" href="css/style.css"><link rel="preload" as="script" href="js/main.js"><link rel="icon" href="favicon.ico"><link rel="stylesheet" type="text/css" media="screen" href="css/style.css"><link rel="canonical" hreflang="ro" href="https://www.arxde.ro/index.html"><link rel="license" href="https://www.arxde.ro/termeni_si_conditii.html"></head><body id="main"><script src="js/main.js"></script><header lang='ro'><nav class="hmain hnav"><a href="https://www.arxde.ro/index.html" class="navlogo">ARXDE&#8482;</a><ul><li class="mnav"><button onclick="NAV_pub()" class="mnav_btn">Publica&#355;ii &#8757;</button><div id="publicatii" class="mnav_content"><a class="actived" href="https://www.arxde.ro/articole.html">Articole</a><a href="https://www.arxde.ro/carti.html">C&#259;r&#355;i</a><a href="https://www.arxde.ro/conferinte.html">Conferinte</a></div></li><li class="mnav"><button onclick="NAV_ser()" class="mnav_btn">Servicii &#8757;</button><div id="servicii" class="mnav_content"><a href="https://www.arxde.ro/cercetare.html">Cercetare</a><a href="https://www.arxde.ro/dezvoltare.html">Dezvoltare</a><a href="https://www.arxde.ro/editoriale.html">Editoriale</a></div></li><li class="mnav"><button onclick="NAV_pro()" class="mnav_btn">Arhiva &#8757;</button><div id="proiecte" class="mnav_content"><a href="https://www.arxde.ro/arhiva_de_matematica.html">Matematic&#259;</a><a href="https://www.arxde.ro/arhiva_de_inginerie.html">Inginerie</a><a href="https://www.arxde.ro/arhiva_de_stiinte.html">&#350;tiin&#355;e</a></div></li><li class="mnav"><button onclick="NAV_cont()" class="mnav_btn">Despre &#8757;</button><div id="contact_main" class="mnav_content"><a href="https://www.arxde.ro/contact.html">Contact</a><a href="https://www.arxde.ro/laborator.html">Laborator</a><a href="https://www.arxde.ro/index.html#noutati">Noutati</a></div></li><li class="mnav"><button onclick="NAV_lang()" class="mnav_btn">RO &#8757;</button><div id="languages" class="mnav_content"><a href="https://www.arxde.ro/en.html">Engleza</a><a href="https://www.arxde.ro/de.html">Germana</a><a href="https://www.arxde.ro/fr.html">Franceza</a><a href="https://www.arxde.ro/it.html">Italiana</a></div></li></ul></nav></header><main><div class="container"><div class="under_nav"> <div class="under_nav_content"> <h3>LSAT: Analiz&#259; computa&#539;ional&#259; a semn&#259;turii luminomorfice</h3><h5>Articol integral: <a href="https://arxiv.org/abs/2301.00281">Lightmorphic Signatures Analysis Toolkit</a></h5><p>&#206;n aceast&#259; lucrare discut&#259;m teoria utilizat&#259; &#238;n proiectarea unui set de instrumente de analiz&#259; SW a semn&#259;turilor luminomorfice (LSAT).</p><p>Pe l&#226;ng&#259; faptul c&#259; ofer&#259; o func&#539;ionalitate de baz&#259;, aplica&#539;ia software permite optimiz&#259;ri specifice datorit&#259; designului s&#259;u modular &#x219;i personalizabil.</p><p>Pentru a promova utilizarea sa &#x219;i a inspira contribu&#539;ii viitoare, LSAT este disponibil gratuit. Prin utilizarea unei re&#539;ele neuronale auto-supravegheate &#x219;i a algoritmilor de &#238;nv&#259;&#539;are automat&#259;, LSAT ofer&#259; o interfa&#539;&#259; u&#x219;or de utilizat, av&#226;nd &#238;n acela&#x219;i timp o documenta&#539;ie ampl&#259;.</p><p>Experimentele demonstreaz&#259; c&#259; LSAT &#238;mbun&#259;t&#259;&#539;e&#x219;te activit&#259;&#539;ile de traducere a datelor semn&#259;turilor luminomorfice &#238;n spectrograme utilizabile.</p><p>Prin func&#539;iile matematice furnizate, LSAT valideaz&#259; neliniaritatea &#238;nt&#226;lnit&#259; &#238;n procesul de conversie a datelor, asigur&#226;nd &#238;n acela&#x219;i timp performan&#539;e ridicate ale algoritmilor de prognoz&#259;.</p><p>Volumele mari de date au fost prelucrate folosind algoritmi de inteligen&#539;&#259;a artificial&#259; &#351;i &#238;nv&#259;&#355;are automat&#259; din ARXDE&#8482;.</p></div><div class="under_nav_content"> <h3>Semn&#259;tura spa&#539;io-temporal&#259; a intensit&#259;&#539;ii luminoase pentru drumurile din Carpa&#539;i</h3><h5>Articol integral: <a href="https://eudl.eu/doi/10.4108/eai.27-4-2021.169422">Spatiotemporal lightmorphic computing for Carpathian roads</a></h5><p>Optimizarea consumului de energie prin anticiparea comportamentului vehiculului &#238;ntr-un mediu dinamic reprezint&#259; un subiect activ de cercetare pentru industria auto.</p> <p>Deoarece vehiculele sunt echipate din ce &#238;n ce mai mult cu sisteme de asisten&#539;&#259; la conducere care func&#539;ioneaz&#259; &#238;n condi&#539;ii dinamice de conducere, o strategie specific&#259; de economisire a energiei trebuie s&#259; ia &#238;n considerare particularit&#259;&#539;ile traiectoriei &#351;i s&#259; prezic&#259; &#238;n timp real oportunit&#259;&#539;ile de economisire a energiei.</p> <p>Cercetarea &#351;i &#238;n&#539;elegerea interac&#539;iunilor dintre formele complexe de intensitate a luminii &#351;i specificitatea spa&#539;iotemporal&#259; a traiectoriei este principalul obiectiv al cadrului de calcul al intensit&#259;&#539;ii luminoase prezentat pentru re&#539;eaua rutier&#259; format&#259; din A1 &#351;i DN7 din mun&#539;ii Carpa&#539;i.</p><p>Sunt incluse loca&#539;ii alternative de pornire &#351;i oprire, &#238;ntre urm&#259;toarele ora&#351;e majore: Bucure&#351;ti, Timi&#351;oara, Deva, Sibiu, Pite&#351;ti.</p><p>Fiecare m&#259;sur&#259;toare a segmentului de traiectorie este compus&#259; din diferite segmente definite ca lungimi de segmentare (SL) care caracterizeaz&#259; semn&#259;turile luminoase &#351;i profilul traiectoriei.</p><p>Varia&#539;iile de intensitate a luminii sunt con&#539;inute &#238;n tensorul de distribu&#539;ie a luminii.</p><p>C&#226;nd se analizeaz&#259; valorile m&#259;surate, similitudinile dintre m&#259;sur&#259;tori sunt capturate &#238;ntr-un set de date specific traiectoriei. Aceast&#259; simetrie de distribu&#539;ie a luminii spa&#539;iotemporale este utilizat&#259; pentru a prezice evolu&#539;ia unic&#259; a formei luminii virtuale.</p><p>Observarea varia&#539;iilor de intensitate a luminii ofer&#259; o perspectiv&#259; unic&#259; asupra traseului men&#539;ionat.</p><p>Av&#226;nd un cadru pentru a caracteriza modelele structurale ale semn&#259;turii luminoase pentru traiectorii rutiere specifice, se pot rezolva mai multe probleme din lumea real&#259;, cum ar fi: realizarea unui echilibru energetic optim pentru traiectorii specifice sau estimarea precis&#259; a fenomenelor de intensitate a luminii care pot avea impact asupra interac&#539;iunii dintre vehicul &#351;i mediul de c&#259;l&#259;torie.</p><p>Am folosit ARXDE&#8482; pentru prelucrarea datelor &#351;i imaginilor folosite la realizarea modelelor tridimensionale pentru semn&#259;turile spa&#355;io-temporale a intensit&#259;&#355;ii luminoase pentru drumurile din Carpa&#355;i.</p><div class="galeria"><img src="img/intensitate_luminoasa_carpati_2.webp" alt="Semn&#259;tura spa&#539;io-temporal&#259; a intensit&#259;&#539;ii luminoase pentru drumurile din Carpa&#539;i" style="max-width:60%;height:auto;"></div><div class="galeria"><img src="img/intensitate_luminoasa_carpati_1.webp" alt="Semn&#259;tura spa&#539;io-temporal&#259; a intensit&#259;&#539;ii luminoase pentru drumurile din Carpa&#539;i" style="max-width:60%;height:auto;"></div></div><div class="under_nav_content"> <h3>Modele de traiectorie predictiv&#259; ale vehiculelor folosind date izocrone</h3><h5>Articol integral: <a href="https://arxiv.org/abs/2010.05026">“Vehicle predictive trajectory patterns from isochronous data.” ArXiv abs/2010.05026 (2020)</a></h5><p>&#206;n aceast&#259; lucrare este prezentat&#259; o metod&#259; detaliat&#259; pentru evaluarea &#351;i cartografierea modelelor de traiectorie izocrone prin utilizarea fuziunii de date video, respectiv a datelor furnizate de senzorul busol&#259; HDMM01. Modelele predictive ale traiectoriei izocrone sunt derivate din valorile datelor av&#226;nd un orizont de timp predefinit. Astfel se poate identifica at&#259;t comportamentul extrem de conducere, c&#226;t &#351;i geometriile periculoase ale drumului. </p> <p>Rezultatele acestui studiu arat&#259; c&#259; tiparele de traiectorie au succes &#238;n prezicerea evolu&#539;iei probabile a unui tipar de traiectorie actual &#351;i pot oferi evaluarea situa&#539;iilor de conducere viitoare.</p> <p>Datele ob&#539;inute din acest studiu pot fi utile ca referin&#539;&#259; &#238;n planificarea urban&#259; viitoare pentru c&#259;ile de conducere care asigur&#259; economie de energie, precum &#351;i pentru &#238;mbun&#259;t&#259;&#539;irea proiect&#259;rii &#351;i ingineriei vehiculelor bazate pe m&#259;sur&#259;tori dinamice cantitative &#351;i relevante.</p> <div class="galeria"><img src="img/pr34.svg" alt="traiectorie predictiv&#259; date izocrone Graz 1"></div><div class="galeria"><img src="img/pr35.svg" alt="traiectorie predictiv&#259; date izocrone Graz 2"></div><div class="galeria"><img src="img/pr36.svg" alt="traiectorie predictiv&#259; date izocrone Graz 3"></div></div><div class="under_nav_content"> <h3>SIMULAREA REŢELELOR NEURONALE FOLOSIND MATLAB&#174;</h3><h5>Articol integral: <a href="http://www.fih.upt.ro/simpozion/Editii%20precedente.htm">SIMPOZION &#350;TIIN&#354;IFIC STUDEN&#354;ESC – „35 de ani de &#238;nv&#259;&#355;&#259;m&#226;nt superior Hunedorean”,  20 – 21 mai 2005</a></h5><p>Metoda descris&#259; pune accentul pe re&#539;inerea a c&#226;t mai multe caracteristici a func&#539;iei RBF(radial basis function).</p><p>Am folosit MATLAB&#174; pentru a implemeta func&#539;ia de analiz&#259; RBF care descrie urm&#259;toarea varia&#539;ie de parametrii:</p><img src="img/22-05-2005.webp" alt="formula matematica RBF" style="max-width:100%;height:auto;" class="center"><p>Re&#539;elele neuronale sunt &#238;n principiu o clas&#259; de func&#359;ii ce pot fi implementate pentru orice fel de model (linear sau neliniar) &#351;i &#238;n orice fel de re&#539;ea (cu un singur strat sau mai multe straturi).</p><p>Re&#539;elele RBF sunt re&#539;ele formate din dou&#259; straturi : nodurile de intrare, neuroni ascun&#351;i cu func&#539;ii de baz&#259; nonliniare, &#351;i neuroni de ie&#351;ire cu func&#539;ii de activare liniare sau nonliniare.</p><p>Sau folosit 25 de neuroni &#351;i pentru fiecare itera&#539;ie am ales varianta cu ad&#259;ugarea a c&#226;te 5 noi neuroni de itera&#539;ie. Dac&#259; s-ar fi folosit un num&#259;r mai mic de neuroni s-ar fi ob&#539;inut rezultate mult mai &#238;ndep&#259;rtate de valoarea impus&#259; prin algoritmul de &#238;nv&#259;&#539;are al re&#539;elei. Se exemplific&#259; &#238;n urm&#259;toarele grafice diferen&#539;ele ob&#539;inute pentru 5, 10, sau mai mul&#355;i neuroni.</p><p>Se poate observa varia&#539;ia fidelit&#259;&#539;ii simul&#259;rii odat&#259; cu cre&#351;terea num&#259;rului de neuroni folosi&#539;i de re&#539;eau neuronal&#259;. Acest aspect poate fi folosit pentru o mare varietate de aplica&#539;ii precum: recunoa&#351;terea digital&#259; a fe&#539;ei, detectarea mirosurilor, clasificarea imaginilor din punct de vedere al caracteristicilor de culoare, aplica&#539;ii de predic&#539;ie a anumitor fenomene.</p></div></div></div></main><div class="footer copyright"><p><a href="https://www.arxde.ro/despre_noi.html">Despre noi</a>&#8942; <a href="https://www.arxde.ro/contact.html">Contact</a></p><p>Copyright © 2023 ARXDE&#8482;. <br> Toate drepturile rezervate.</p><p><a href="https://www.arxde.ro/termeni_si_conditii.html">Termeni &#351;i condi&#539;ii</a></p></div></body></html>
